buffosens/EK-TM4C1294XL-BOOSTXL-EDUMKII/Config/Config.c
/*
 *  =============================== WiFi ===============================
 */
/* Place into subsections to allow the TI linker to remove items properly */
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(WiFi_config, ".const:WiFi_config")
#pragma DATA_SECTION(wiFiCC3100HWAttrs, ".const:wiFiCC3100HWAttrs")
#endif

#include <ti/drivers/WiFi.h>
#include <ti/drivers/wifi/WiFiCC3100.h>

WiFiCC3100_Object wiFiCC3100Objects[EK_TM4C1294XL_WIFICOUNT];

const WiFiCC3100_HWAttrs wiFiCC3100HWAttrs[EK_TM4C1294XL_WIFICOUNT] = {
    {
        .irqPort = GPIO_PORTM_BASE,
        .irqPin = GPIO_PIN_3,
        .irqIntNum = INT_GPIOM,

        .csPort = GPIO_PORTH_BASE,
        .csPin = GPIO_PIN_2,

        .enPort = GPIO_PORTC_BASE,
        .enPin = GPIO_PIN_6
    }
};

const WiFi_Config WiFi_config[] = {
    {
        .fxnTablePtr = &WiFiCC3100_fxnTable,
        .object = &wiFiCC3100Objects[0],
        .hwAttrs = &wiFiCC3100HWAttrs[0]
    },
    {NULL,NULL, NULL},
};

/*
 *  ======== EK_TM4C1294XL_initWiFi ========
 */
void EK_TM4C1294XL_initWiFi(void)
{
    /* Configure EN & CS pins to disable CC3100 */
    GPIOPinTypeGPIOOutput(GPIO_PORTH_BASE, GPIO_PIN_2);
    GPIOPinTypeGPIOOutput(GPIO_PORTC_BASE, GPIO_PIN_6);
    GPIOPinWrite(GPIO_PORTH_BASE, GPIO_PIN_2, GPIO_PIN_2);
    GPIOPinWrite(GPIO_PORTC_BASE, GPIO_PIN_6, 0);

    /* Configure SSI2 for CC3100 */
    SysCtlPeripheralEnable(SYSCTL_PERIPH_SSI2);
    GPIOPinConfigure(GPIO_PD3_SSI2CLK);
    GPIOPinConfigure(GPIO_PD1_SSI2XDAT0);
    GPIOPinConfigure(GPIO_PD0_SSI2XDAT1);
    GPIOPinTypeSSI(GPIO_PORTD_BASE, GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_3);

    /* Configure IRQ pin */
    GPIOPinTypeGPIOInput(GPIO_PORTM_BASE, GPIO_PIN_3);
    GPIOPadConfigSet(GPIO_PORTM_BASE, GPIO_PIN_3, GPIO_STRENGTH_2MA,
                     GPIO_PIN_TYPE_STD_WPD);
    GPIOIntTypeSet(GPIO_PORTM_BASE, GPIO_PIN_3, GPIO_RISING_EDGE);

    SPI_init();
    EK_TM4C1294XL_initDMA();

    WiFi_init();
}

/*
 *  =============================== ADC ===============================
 */
void Edu_initADC(void)
{
    //
       // The ADC0 peripheral must be enabled for use.
       //
       SysCtlPeripheralEnable(SYSCTL_PERIPH_ADC0);

       //
       // For this example ADC0 is used with AIN0 on port E7.
       // The actual port and pins used may be different on your part, consult
       // the data sheet for more information.  GPIO port E needs to be enabled
       // so these pins can be used.
       // TODO: change this to whichever GPIO port you are using.
       //
       SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOE);

       //
       // Select the analog ADC function for these pins.
       // Consult the data sheet to see which functions are allocated per pin.
       // TODO: change this to select the port/pin you are using.
       //
       GPIOPinTypeADC(GPIO_PORTE_BASE, GPIO_PIN_4); //
       GPIOPinTypeADC(GPIO_PORTE_BASE, GPIO_PIN_3);

       //
       // Enable sample sequence 3 with a processor signal trigger.  Sequence 3
       // will do a single sample when the processor sends a signal to start the
       // conversion.  Each ADC module has 4 programmable sequences, sequence 0
       // to sequence 3.  This example is arbitrarily using sequence 3.
       //
       ADCSequenceConfigure(ADC0_BASE, 0, ADC_TRIGGER_PROCESSOR, 0);

       //
       // Configure step 0 on sequence 3.  Sample channel 0 (ADC_CTL_CH0) in
       // single-ended mode (default) and configure the interrupt flag
       // (ADC_CTL_IE) to be set when the sample is done.  Tell the ADC logic
       // that this is the last conversion on sequence 3 (ADC_CTL_END).  Sequence
       // 3 has only one programmable step.  Sequence 1 and 2 have 4 steps, and
       // sequence 0 has 8 programmable steps.  Since we are only doing a single
       // conversion using sequence 3 we will only configure step 0.  For more
       // information on the ADC sequences and steps, reference the datasheet.
       //
       ADCSequenceStepConfigure(ADC0_BASE, 0, 0, ADC_CTL_CH9);
       ADCSequenceStepConfigure(ADC0_BASE, 0, 1, ADC_CTL_CH0 | ADC_CTL_IE |
                                ADC_CTL_END);

       //
       // Since sample sequence 3 is now configured, it must be enabled.
       //
       ADCSequenceEnable(ADC0_BASE, 0);

       //
       // Clear the interrupt status flag.  This is done to make sure the
       // interrupt flag is cleared before we sample.
       //
       ADCIntClear(ADC0_BASE, 0);
}
